app/Http/Controllers/Admin/instructionsController.php

    public function index()
    {
        $instructions = Instructions::with('snippets')
        ->get()
        ->map(function ($instruction) {
            $instruction->authorId = User::find($instruction->authorId);
            // Collect unique vendor IDs from the instruction's snippets
            $vendorIds = $instruction->snippets->pluck('vendorId')->unique();

            // Assign the vendor titles to the instruction
            $instruction->vendorsList = Vendors::whereIn('id', $vendorIds)->pluck('img');

            return $instruction;
        });
---
select * from `vendors` where `vendors`.`id` in (2)
select `instructions`.*, `users`.`name`, `snippets`.`vendorId` as `vendors` from `instructions` inner join `users` on `users`.`id` = `instructions`.`authorId` inner join `snippets` on `snippets`.`instructionsId` = `instructions`.`id`
select * from `snippets` where `snippets`.`instructionsId` in (11)
select * from `users` where `users`.`id` = 1 limit 1
select `img` from `vendors` where `id` in (2, 5)

    public function create()
    {
        return Inertia::render('Admin/instructions/create',[
            'vendors' => vendors::all()
        ]);
---
select * from `vendors`

    public function edit(string $id)
    {
        $instructions = Instructions::where('id','=',$id)->with('snippets')->first();

        //return(dd($id));

        return Inertia::render('Admin/instructions/edit',[
            'vendors' => vendors::all(),
            'instructions' => $instructions
        ]);
---
select * from `instructions` where `instructions`.`id` = '11' limit 1
select * from `snippets` where `snippets`.`instructionsId` in (11)
select * from `instructions` where `id` = '11'
select * from `vendors`

    public function update(Request $request, string $id)
    {
        //return dd($request->instruction);

        Instructions::where('id','=', $id)->update([
            'title' => $request->instruction['title'],
            'description' => $request->instruction['description']
        ]);
---
update `instructions` set `title` = 'Laravel TinyMCE editor edit', `description` = '<p>TinyMCE 6 is a powerful and flexible rich text editor that can be embedded in web applications. This quick start covers how to add a TinyMCE editor to a web page using npm or Yarn. edit</p>', `instructions`.`updated_at` = '2024-02-02 23:04:11' where `id` = '11'