app/Http/Controllers/Admin/snippetsController.php

select * from `vendors` where `vendors`.`id` in (2, 3, 5)
select `snippets`.*, `users`.`name`, `users`.`id` as `authorId`, `vendors`.`title` as `vendorTitle`, `vendors`.`img` as `vendorIcon` from `snippets` inner join `users` on `users`.`id` = `snippets`.`authorId` inner join `vendors` on `vendors`.`id` = `snippets`.`vendorId`
---
    public function index()
    {
        return Inertia::render('Admin/Snippets/index',[
            'snippets' => snippets::with('author','vendor','instruction')->get()
        ]);

select * from `vendors`
---
    public function create()
    {
        return Inertia::render('Admin/Snippets/create',[
            'vendors' => vendors::all()
        ]);

insert into `snippets` (`title`, `description`, `vendorId`, `authorId`, `statusId`, `listPosition`) values ('Kill Process on Ubuntu', '<pre class=\"language-markup\"><code>sudo kill -9 `sudo lsof -t -i:9001`\n</code></pre>\n<p>Or</p>\n<pre class=\"language-markup\"><code>sudo kill -9 $(sudo lsof -t -i:9001)\n</code></pre>', 3, 1, 1, 1)
---
    public function store(Request $request)
    {
        //return dd($request);

        snippets::insert([
            'title' => $request->title,
            'description' => $request->description,
            'vendorId' => $request->vendor,
            'authorId' => $request->user()->id,
            'statusId' => 1,
            'listPosition' => 1
        ]);

update `snippets` set `title` = 'Initiate Editor', `description` = '<pre class=\"language-markup\"><code>&lt;Editor\nv-model=\"snippetForm.description\"\napi-key=\"API_KEY\"\n:init=\"{\n    menubar: false,\n    height: 200,\n    plugins: \'lists link code wordcount codesample\',\n    toolbar: \'codesample | bold italic backcolor | \ bullist link\'\n}\"\n/&gt;</code></pre>', `vendorId` = 5, `statusId` = 1, `snippets`.`updated_at` = '2024-02-02 22:21:38' where `id` = '61'
---
    public function update(Request $request, string $id)
    {
        snippets::where('id','=', $id)->update([
            'title' => $request->title,
            'description' => $request->description,
            'vendorId' => $request->vendor,
            'statusId' => 1
        ]);

delete from `snippets` where `id` = 54
select * from `snippets` where `snippets`.`id` = '54' limit 1
---
    public function destroy(string $id)
    {

        $snippet = Snippets::findOrFail($id)->delete();