app/Http/Controllers/Admin/vendorsController.php

    public function edit(string $id)
    {
        return Inertia::render('Admin/Vendors/edit',[
            'vendor' => vendors::where('id', $id)->first()
        ]);
---
select * from `vendors` where `id` = '5' limit 1

    public function update(Request $request, string $id)
    {
        if($request->file('icon')){
            $imagePath = $request->file('icon')->store('vendorIcons', 'public');
            vendors::where('id',$id)->update([
                'img' => $imagePath,
            ]);
        }

        vendors::where('id',$id)->update([
            'title' => $request->data['name'],
            'description' => $request->data['description'],
            'authorId' => $request->user()->id,
            'statusId' => 1
        ]);
---
update `vendors` set `title` = 'vueJs', `description` = '<p class=\"description\" data-v-a5e898ee=\"\">An approachable, performant and versatile framework for building web user interfaces.</p>', `authorId` = 1, `statusId` = 1, `vendors`.`updated_at` = '2024-02-02 19:07:34' where `id` = '5'